lang = {}

lang["press_spacebar"] = "스페이스바를 눌러주세요."

lang["achivements"] = {}
lang["achivements"][1] = {"프레첼 브레이크", "첫번째 스테이지를 클리어하세요."}
lang["achivements"][2] = {"쿠키 탈출", "쿠키 공장을 죽지 않고 클리어하세요."}
lang["achivements"][3] = {"초콜렛 탈출", "초콜렛 공장을 죽지 않고 클리어하세요."}
lang["achivements"][4] = {"캔디 탈출", "캔디 공장을 죽지 않고 빠져나가세요."}
lang["achivements"][5] = {"껌 탈출", "껌 공장을 죽지 않고 빠져나가세요."}
lang["achivements"][6] = {"콜라 탈출", "콜라 공장을 죽지 않고 빠져나가세요."}
lang["achivements"][7] = {"슈가 스핀", "10000개의 패널을 뒤집으세요."}
lang["achivements"][8] = {"점프 마스터", "1000번 이상 점프하세요."}
lang["achivements"][9] = {"설탕물", "노말 엔딩을 보세요."}
lang["achivements"][10] = {"설탕의 왕", "트루 엔딩을 보세요."}

lang["collections"] = {}
lang["collections"][1] = {"크리스탈", "설탕 크리스탈을 획득하세요."}
lang["collections"][2] = {"다이아몬드", "설탕 다이아몬드를 획득하세요."}
lang["collections"][3] = {"오팔", "설탕 오팔을 획득하세요."}
lang["collections"][4] = {"플래티넘", "설탕 플래티넘을 획득하세요."}
lang["collections"][5] = {"루비", "설탕 루비를 획득하세요."}
lang["collections"][6] = {"가넷", "설탕 가넷을 획득하세요."}
lang["collections"][7] = {"에메랄드", "설탕 에메랄드를 획득하세요."}
lang["collections"][8] = {"페리도트", "설탕 페리도트를 획득하세요."}
lang["collections"][9] = {"사파이어", "설탕 사파이어를 획득하세요."}
lang["collections"][10] = {"토파즈", "설탕 토파즈를 획득하세요."}

lang["notices"] = {}
lang["notices"][1] = {"　　　　  은 반대로 뒤집힙니다.\n \n　　　 　　 　　　 을 잘\n살펴보세요!", "지나간 벽\n \n주변에 있는 박스들"}
lang["notices"][2] = {"　　　　　 로\n할 수 있습니다!", "\"쉬프트 키\" 　\"뒤집기를 제어\""}
lang["notices"][3] = {"　 중간쯤에 구멍이 있는 거\n같은데...", "빛"}
lang["notices"][4] = {"　괴물들을 조심하세요!\n \n　당신은 마리오가 아니랍니다.", " \n　괴물들은 밟아도 안 죽습니다."}
lang["notices"][5] = {"여긴 양쪽이 똑같이 뒤집힙니다.\n데칼코마니 처럼요.\n그러니　　　　잘 지켜보세요!", " \n \n　　　 양쪽 다"}
lang["notices"][6] = {"　　  　　을 전부\n모아보세요!\n전부 모으면 　　　 　　을\n볼 수 있습니다.", "설탕 보석\n \n　　 　　　 \"트루 엔딩\""}
lang["notices"][7] = {"잠깐만요!\n　　　　　　　  도 생각해보세요.", "\n \n어떻게 돌아올지"}
lang["notices"][8] = {"벽을 뒤집어 \n큰 보스를 떨어트리세요!", "　　　  　　다리를 없애서"}
lang["notices"][9] = {"미끄럽죠?", "\n \n빨라집니다."}
lang["notices"][10] = {"혼자서만 벽을 뒤집을 수 있다\n생각하지 마세요!", ""}
lang["notices"][11] = {"\n \n뒤집기를 제어중일땐\n사용할 수 없어요.", "텔레포트!"}
lang["notices"][12] = {"\n \n물론 작다는 말은 각설이의 키가\n작다는 뜻입니다.", "입구가 키에 비해 너무 작네요."}
lang["notices"][13] = {"선풍기도 벽을 뒤집습니다.\n인생은 타이밍이죠..", ""}
lang["notices"][14] = {"키가 너무 크다구요?\n걱정할 거 없어요.", "\n \n \n각설탕이잖아요."}
lang["notices"][15] = {"이번엔　　　　　　　　  으로.\n　　　　　　끄앙...", "　　  　위와 아래가 대칭\n뒤집힙니다."}
lang["notices"][16] = {"이 크래커는\n　　  특별 크래커입니다.", "　　　　　　오라를 움직\n이는"}
lang["notices"][17] = {"우산이 필요한가요?\n거기 어딘가에 있어요.", ""}
lang["notices"][18] = {"기억하세요,\n지금 안 가면 못가요!", "　　　　　  인생은 타이밍입니다."}
lang["notices"][19] = {"저기 　　　 같이 생긴것을\n쓰면 뭔가가 뒤집힐 거\n같아요!", "　 　리모콘"}
lang["notices"][20] = {"저게 마리오의 별은 아니지만\n모든 벽을 뒤집을 수 있어요.", "\n \n \n모든 벽을 몽땅!"}
lang["notices"][21] = {"　조심하세요!", ""}
lang["notices"][22] = {"살다보면 가끔\n이 생기기도 해요.", "　　　　　　　돌이킬 수 없는 일"}
lang["notices"][23] = {"쉬프트 키가 뭐에 쓰는 키였더라...\n맞다, ", "\n \n　　　뒤집기 제어!"}
lang["notices"][24] = {"끈적거리는 껌...\n　　　　  있을 정도로 끈적거려요!", "\n \n벽을 탈 수"}
lang["notices"][25] = {"\n \n무적이 되는건 아니구요.\n　　　　키나　　키로", "슈퍼 각설이!\n \n\"컨트롤\"　 　\"X\"\n벽을 전부 뒤집을 수 있어요."}
lang["notices"][26] = {"　당신이 진정한 뒤집기의 고수입니까?\n　　　　　　　　　　　 문이 열립니다!", "\n \n　100번 넘게 뒤집으면"}
lang["notices"][27] = {"\n \n어때요, 컨트롤하기 참 쉽죠?", "쉬프트키만 잘 쓰면 됩니다."}
lang["notices"][28] = {"\n \n근데 손대면 톡 하고 터져버릴거에요.\n　　　　　　　　　 　:)", "방울을 타고 멀리 날아갈 수 있어요!\n \n상냥하게 대해주세요."}
lang["notices"][29] = {"핸젤과 그레텔 기억나세요?\n그정도로 똑독하진 않을 거 같아서\n \n저 착하죠?", "\n \n \n제가 돌아갈 길을 준비해놨어요."}
lang["notices"][30] = {"벌써 여기까지 오다니!.\n하나도 안 힘들어 보이네요.", "\n \n \n그래서 점프를 없앴습니다!"}
lang["notices"][31] = {"당신이 저 곰을 유혹할만큼\n멋지다고 생각하나요?", "\n \n \n데이트 하러 가자 그래요!"}
lang["notices"][32] = {"저를 믿어요.\n그냥 문을 향해", "\n \n　　　　　　　 뛰세요!"}
lang["notices"][33] = {"이번엔 제가 아니라 당신이 직접\n　　　　　　　　보세요.", "\n \n타이밍을 만들어"}
lang["notices"][34] = {"　　키나　　　　　　키로\n점프하세요.", "\"Z\"　　　\"스페이스\""}
lang["notices"][35] = {"재시작이 필요한가요?　　키를\n누르면 됩니다. 간단하죠?", "　　　 　　　　　　　\"R\""}
lang["notices"][36] = {"한번 더 절", "　　　 　　믿어보세요."}

lang["korean_notice"] = [[            대한민국에는 게임(무료 게임도 포함)에 대한 사전 검열 제도가 있습니다.
                             이 제도를 만드신 분들은 청소년 보호를 위해(?)
                       "게임 셧다운제"와 "게임 쿨링오프제"법안도 만들었습니다.
                                우리는 게임을 사회악이나 마약 취급을 하는
                                  대한민국 정부에 대해 동의하지 않습니다.
                          우리는 대한민국 정부가 이런 법안들을 철회하기 전 까지
                                   어떠한 한국어 게임도 만들지 않을 것입니다.
                        		      	       ...였는데 죄송합니다 한글화 해 버려서 ㅜㅜ
                        		      	      한글화 - iAmGhost (http://iamghost.kr)]]